; domain
(DEFINE (DOMAIN restaurant)
(:REQUIREMENTS :TYPING :STRIPS )
(:TYPES 
PERSON FOOD LOCATION - OBJECT
CHEF GUEST WAITER - PERSON
)
(:PREDICATES
(WANTS ?P00 - PERSON ?F10 - FOOD)
(HAS ?P00 - PERSON ?F10 - FOOD)
(BE-FULL ?P00 - PERSON)
(AT ?L00 - LOCATION ?P10 - PERSON)
)
(:ACTION COOK
    :PARAMETERS (?CHEF - CHEF ?FOOD - FOOD)
    :PRECONDITION (WANTS ?CHEF ?FOOD)
    :EFFECT (AND (HAS ?CHEF ?FOOD)(NOT(WANTS ?CHEF ?FOOD)))
)

(:ACTION ORDER
    :PARAMETERS (?INTERLOCUTOR1 ?INTERLOCUTOR2 - PERSON ?FOOD - FOOD ?LOC - LOCATION)
    :PRECONDITION (AND (AT ?LOC ?INTERLOCUTOR1)
                       (AT ?LOC ?INTERLOCUTOR2)
                       (WANTS ?INTERLOCUTOR2 ?FOOD)
                  )
    :EFFECT (AND 
                (WANTS ?INTERLOCUTOR1 ?FOOD)
            )
)

(:ACTION EAT
    :PARAMETERS (?PERSON - PERSON ?FOOD - FOOD)
    :PRECONDITION (AND (HAS ?PERSON ?FOOD))
    :EFFECT (AND (NOT (HAS ?PERSON ?FOOD))
                 (BE-FULL ?PERSON)
            )
)

(:ACTION GOT-TO
    :PARAMETERS (?START ?DESTINATION - LOCATION ?NAME - WAITER)
    :PRECONDITION (AND (AT ?START ?NAME))
    :EFFECT (AND (NOT (AT ?START ?NAME))(AT ?DESTINATION ?NAME))
)

(:ACTION GIVE
    :PARAMETERS (?INTERLOCUTOR1 ?INTERLOCUTOR2 - PERSON ?FOOD - FOOD ?LOC - LOCATION)
    :PRECONDITION (AND (AT ?LOC ?INTERLOCUTOR1)
                       (AT ?LOC ?INTERLOCUTOR2)
                       (WANTS ?INTERLOCUTOR2 ?FOOD)
                       (HAS ?INTERLOCUTOR1 ?FOOD)
                  )
    :EFFECT (AND 
            (NOT (WANTS ?INTERLOCUTOR2 ?FOOD))
            (NOT (HAS ?INTERLOCUTOR1 ?FOOD))
            (HAS ?INTERLOCUTOR2 ?FOOD)
            )
)


)

; problem
(define (problem alice_is_hungry)(:domain restaurant)
(:objects
   james - Waiter
   bob - Chef
   alice - Guest
   pizza - Food
   kitchen table entrance - Location
)
(:init
   (at entrance james)
   (at table alice)
   (at kitchen bob)
   (wants alice pizza)
)
(:goal (and
   (be-full alice)
   )
))

; plan
1. (got-to entrance table james)
   deleted: (at entrance james)
   added: (at table james)
   goals met: 0 of 1
2. (order james alice pizza table)
   added: (wants james pizza)
   goals met: 0 of 1
3. (got-to table kitchen james)
   deleted: (at table james)
   added: (at kitchen james)
   goals met: 0 of 1
4. (order bob james pizza kitchen)
   added: (wants bob pizza)
   goals met: 0 of 1
5. (cook bob pizza)
   deleted: (wants bob pizza)
   added: (has bob pizza)
   goals met: 0 of 1
6. (give bob james pizza kitchen)
   deleted: (wants james pizza) (has bob pizza)
   added: (has james pizza)
   goals met: 0 of 1
7. (got-to kitchen table james)
   deleted: (at kitchen james)
   added: (at table james)
   goals met: 0 of 1
8. (give james alice pizza table)
   deleted: (wants alice pizza) (has james pizza)
   added: (has alice pizza)
   goals met: 0 of 1
9. (eat alice pizza)
   deleted: (has alice pizza)
   added: (be-full alice)
   goals met: 1 of 1
